#+TITLE: Some title
#+AUTHOR: Author 1
#+DATE: 2021:04:29
#+OPTIONS: h:6 num:t toc:nil
#+PROPERTY: header-args:matlab :session *MATLAB* :results output :exports both :eval never-export :noweb yes
#+property: header-args:julia  :session *Julia*  :exports both :eval never-export :async t
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+latex_engraved_theme: ef-light
#+LATEX_CLASS: autart
#+LATEX_CLASS_OPTIONS: [twocolumn]
#+LATEX_HEADER: \input{preamble.tex}
#+latex_header: \usepackage{float}
#+EXCLUDE_TAGS: noexport
#+LATEX: \begin{frontmatter}
#+LATEX: \title{Some title} 
#+LATEX: \author[ABCDa]{Author 1}\ead{something}
#+LATEX: \author[ABCDb]{Author 2}\ead{something}
#+LATEX: \address[ABCDa]{Some address 1}
#+LATEX: \address[ABCDb]{Some address 2}
# #+latex_class: article
# #+latex_class_options: [10pt]
#+LATEX_HEADER: \usepackage{cancel}
#+latex_header: \usepackage{mathtools}
#+BIBLIOGRAPHY: ~/Documents/roam/biblio.bib
#+EXCLUDE_TAGS: noexport ignore
#+STARTUP: showall hideblocks 

\begin{keyword}                           
averaging control; open-loop control systems; periodic motion, stabilization methods, time-varying systems.   
\end{keyword}

#+begin_abstract
* Test

\begin{align*}
  \begin{bmatrix} 
1  & 2 & 3 & 4 \\
8  & 4 & -2 & 4 \\
0  & 1 & a & b
 \end{bmatrix}
\end{align*}

| one | two | three | four |
|-----+-----+-------+------|
|   1 |   2 |     3 |    4 |
|   5 |   6 |     7 |    8 |

#+BEGIN_SRC python
prlist(range(1,10))
#+END_SRC

#+RESULTS:
None


\begin{align}
\label{eq:dip-dynamics-T}
& T[\phi, \dot{\phi}] = \frac{1}{2} m_1 (\dot{x}_1^2 + \dot{y}_1^2) + \frac{1}{2} m_2 (\dot{x}_2^2 + \dot{y}_2^2) \nonumber \\
& = \frac{1}{2} (m_1 + m_2) l_1^2 \dot{\phi_1}^2 + \frac{1}{2} m_2 l_2^2 \dot{\phi_2}^2 \nonumber \\
& + m_2 l_1 l_2 \cos(\phi_1 - \phi_2) \dot{\phi_1} \dot{\phi_2} \nonumber \\
& = \frac{1}{2} \dot{\phi}^{T} \left[ \begin{smallmatrix}
 (m_{1} + m_{2}) l_{1}^2 &  m_{2} l_{1} l_{2} \cos(\phi_1 - \phi_2) \\
 m_{2} l_{1} l_{2} \cos(\phi_1 - \phi_2) &  m_{2} l_{2}^2
 \end{smallmatrix} \right] \dot{\phi} \nonumber \\
& =: \frac{1}{2} \dot{\phi}^{T} M_\phi\ \dot{\phi}
\end{align}


